# Задача: Сколько нужно двухместных парт для учеников классов a, b, c 

# a = 20
b = 21
# c = 22

# print(((a + 1) // 2) + ((b + 1) // 2) + ((c + 1) // 2))

print(b / 2) # 10.5
print(round(b / 2)) # 10
print(round((b + 0.1 ) / 2)) # 11
print(b // 2) # 10

print(b % 2) # 1
k = 21.4
print(k % 2) # 1.3999999999999986

n = 423
summa = 0